### Importing neccessary libraries

In [1]:
import os
import pandas as pd
import numpy as np

### My stored file path

In [2]:
dir_path='C:/Users/Chisom/Documents/Moniepoint/test-case-1'
files=os.listdir(dir_path)

## 1) Highest sales volume in a day

In [3]:
sales_vol=[]

In [4]:
# Find the len of each file, each line corresponds to the number of sales that day and append each instance to the sales_vol list
for file in files:
    df=pd.read_csv(f"C:/Users/Chisom/Documents/Moniepoint/test-case-1/{file}",delimiter=',', header=None)
    sales_vol_value=len(df)
    sales_vol.append(sales_vol_value)

In [5]:
# Get a dataframe mapping the files to their sales volume (len)
sales_vol_df=pd.DataFrame({'Date':files,'Sales_vol':sales_vol})

#### 2025-10-10 is the day with the highest sales volume, with 999 sales that day

In [6]:
# Sort the sales volume so the biggest value is top
sales_vol_df.sort_values('Sales_vol',ascending=False).head(2)

               Date  Sales_vol
282  2025-10-10.txt        999
168  2025-06-18.txt        998

## 2)Highest sales value in a day

In [7]:
sales_value=[]

In [8]:
# For each day, get the sales value column and then get the total sales value for that day and then save to the sales_value list
for file in files:
    df=pd.read_csv(f"C:/Users/Chisom/Documents/Moniepoint/test-case-1/{file}",delimiter=',', header=None)
    sales_value_col=list(df[3])
    total_value=sum(sales_value_col)
    sales_value.append(total_value)

In [9]:
# Get a dataframe mapping the files (each day) to their sales value
sales_value_df=pd.DataFrame({'Date':files,'Sales_value':sales_value})

#### 2025-01-28 is the day with the highest sales value worth about 25325300

In [10]:
# Sort the sales volume so the biggest value is top
sales_value_df.sort_values('Sales_value',ascending=False).head(2)

               Date   Sales_value
27   2025-01-28.txt  2.532530e+07
106  2025-04-17.txt  2.527651e+07

## 3) Highest sales staff ID for each month

In [11]:
staff_sales_df=pd.DataFrame()

In [12]:
# Read the staff_id,timedate and sales value into one dataframe
for file in files:
    df=pd.read_csv(f"C:/Users/Chisom/Documents/Moniepoint/test-case-1/{file}",delimiter=',', header=None)
    df=df[[0,1,3]]
    df.rename(columns={0:'staff_id',1:'timedate',3:'sales_value'},inplace=True)
    staff_sales_df=pd.concat([staff_sales_df,df],ignore_index=True)

In [13]:
# Extracting the month column from the timedate column, then I drop the timedate column
staff_sales_df['month']=staff_sales_df['timedate'].str[5:7].astype(int)
staff_sales_df=staff_sales_df[['staff_id','sales_value','month']]

In [14]:
staff_sales_df

        staff_id  sales_value  month
0              8    30160.973      1
1              7    21115.795      1
2              8    29430.205      1
3              3    71913.089      1
4              4    21153.156      1
...          ...          ...    ...
204119         8     1174.526     12
204120         1    13998.595     12
204121         2    18828.245     12
204122         1     2433.000     12
204123         2    28672.877     12

[204124 rows x 3 columns]

In [15]:
# Making smaller dataframes corresponding to the appropriate months
jan=staff_sales_df.loc[staff_sales_df['month']==1]
feb=staff_sales_df.loc[staff_sales_df['month']==2]
mar=staff_sales_df.loc[staff_sales_df['month']==3]
apr=staff_sales_df.loc[staff_sales_df['month']==4]
may=staff_sales_df.loc[staff_sales_df['month']==5]
june=staff_sales_df.loc[staff_sales_df['month']==6]
july=staff_sales_df.loc[staff_sales_df['month']==7]
aug=staff_sales_df.loc[staff_sales_df['month']==8]
sept=staff_sales_df.loc[staff_sales_df['month']==9]
october=staff_sales_df.loc[staff_sales_df['month']==10]
nov=staff_sales_df.loc[staff_sales_df['month']==11]
dec=staff_sales_df.loc[staff_sales_df['month']==12]

In [16]:
jan.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
1     1         4.781945e+07
      8         4.779696e+07

In [17]:
feb.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
2     7         4.316292e+07
      6         4.183651e+07

In [18]:
mar.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
3     7         5.164356e+07
      5         5.155085e+07

In [19]:
apr.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
4     4         5.179796e+07
      2         5.117162e+07

In [20]:
may.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
5     5         5.019596e+07
      6         4.950653e+07

In [22]:
june.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
6     9         4.902739e+07
      4         4.788711e+07

In [24]:
july.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
7     4         4.981589e+07
      5         4.858197e+07

In [25]:
aug.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
8     1         4.988031e+07
      5         4.882654e+07

In [27]:
sept.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
9     2         4.982418e+07
      7         4.952975e+07

In [28]:
october.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
10    8         5.629868e+07
      5         5.323173e+07

In [29]:
nov.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
11    6         4.827074e+07
      1         4.820159e+07

In [30]:
dec.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
12    5         4.733602e+07
      4         4.599187e+07

##### For January, it is Staff_id 1
##### For Febuary, it is Staff_id 7
##### For March, it is Staff_id 7
##### For April, it is Staff_id 4
##### For May, it is Staff_id 5
##### For June, it is Staff_id 9
##### For July, it is Staff_id 4
##### For August, it is Staff_id 1
##### For September, it is Staff_id 2
##### For October, it is Staff_id 8
##### For November, it is Staff_id 6
##### For December, it is Staff_id 5

## Highest hour of the day by average transaction volume

In [31]:
combined_df=pd.DataFrame()

In [32]:
# Read through all the files, save the timedate and value columns in a dataframe called combined_df
for file in files:
    df=pd.read_csv(f"C:/Users/Chisom/Documents/Moniepoint/test-case-1/{file}",delimiter=',', header=None)
    df=df[[1,3]]
    df.rename(columns={1:'timedate',3:'sales_value'},inplace=True)
    combined_df=pd.concat([combined_df,df],ignore_index=True)

In [33]:
combined_df.head()

              timedate  sales_value
0  2025-01-01T14:56:52    30160.973
1  2025-01-01T13:23:13    21115.795
2  2025-01-01T09:08:29    29430.205
3  2025-01-01T15:24:51    71913.089
4  2025-01-01T11:09:53    21153.156

In [34]:
# making a new column called hour by extracting the hour from the timedate col
combined_df['hour']=combined_df['timedate'].str[11:13].astype(int)

In [35]:
# Grouping each hour by the average sales
sales_by_hour=combined_df[['sales_value','hour']].groupby('hour').mean()
sales_by_hour

       sales_value
hour
8     25085.421679
9     25295.291374
10    25184.526550
11    25208.543381
12    25285.714724
13    25021.116805
14    25025.753242
15    25162.128240
16    25415.989050

#### 16 Hours has the highest average transaction volume

In [36]:
# Sort the sales value so the biggest value is top
sales_by_hour.sort_values('sales_value',ascending=False).head(2)

       sales_value
hour
16    25415.989050
9     25295.291374